# -*- codeing = utf-8 -*-
# Author：ASyo
# Date：2023-9-12
# Time：8:43
from Printer_out_Close import Printer, Programe_colse

'''
参数说明
Mpa：最高工作压力Pw
T_max最高工作温度：30℃
T_dmax：设计温度 根据工作温度加5-10℃

V：容积
Pd：设计压力
Pc：计算设计压力=Pd
Sm:设计寿命
Whcd：危害程度 1.05-1.1倍
Rl：容器类别
Material：材料
C1钢板厚度负偏差C18 ：C1=0.3mm
Fai：焊接接头系数φ
C2：腐蚀余量 每年按0.1mm/年腐蚀速率
gczj：公称直径为1100mm、



'''

# 第一章Yi
Mpa = float(input('请输入最高工作压力：'))
V = float(input('请输入容积：'))
Yi_1 = '1、空气缓冲\n'
Yi_2 = '2、结构说明及管口表格\n'
Yi = '第一章 整体设计\n' + Yi_1 + Yi_2
# 第二章Er
Pd = 1.05 * Mpa
Rl = input('请输入容器类别（1或2）：')
if Rl == 1:
    Rl = 'I'
else:
    Rl = 'II'
Er_6 = '第二章 技术参数设计（11个参数）\n1、介质：空气\n2、最高工作压力Pw：1.15Mpa\n3、最高工作温度：30℃\n4、设计寿命：20年\n5、容积：2.35m3\n6、设计压力Pd：一般取最高工作压力的1.05-1.1倍\n故Pd=1.05XPw=1.05X{0}=1.2075\n'.format(
    Pd)
Er_7 = '7、设计温度Td：设计温度Td：根据工作温度加5-10℃，根据介质的危险程度确定工作温度的高低，如果介质危害长度低，取5℃反之取10℃\n故Td=30+5=35℃\n8、容器类别判定{0}（空气属于第二组介质）\n9、材料设计（确定主要受压元件材质）\n选Q345R\n10、钢板厚度负偏差C1：C1=0.3mm\n11、焊接接头系数φ：\n说明：双面焊、100%无损检测取φ=1.0\n12、腐蚀余量C2：根据设计寿命，每年按0.1mm/年负数速率为参考\nC2=20X0.1=2m'.format(
    Rl)
Er = Er_6 + Er_7

# 第三章 几何参数设计San

# 定义数据

# 公称直径
DN_L = [300, 350, 400, 450, 500, 550, 600, 650, 700, 750, 800, 850, 900, 950, 1000, 1100, 1200, 1300, 1400, 1500, 1600,
        1700, 1800, 1900, 2000, 2100, 2200, 2300, 2400, 2500, 2600, 2700, 2800, 2900, 3000, 3100, 3200, 3300, 3400,
        3500, 3600, 3700, 3800, 3900, 4000, 4100, 4200, 4300, 4400, 4500, 4600, 4700, 4800, 4900, 5000, 5100, 5200,
        5300, 5400, 5500, 5600, 5700, 5800, 5900, 6000]
# 总深度
H_L = [100, 113, 125, 138, 150, 163, 175, 188, 200, 213, 225, 238, 250, 263, 275, 300, 325, 350, 375, 400, 425, 450,
       475, 500, 525, 565, 590, 615, 640, 665, 690, 715, 740, 765, 790, 815, 840, 865, 890, 915, 940, 965, 990, 1015,
       1040, 1065, 1090, 1115, 1140, 1165, 1190, 1215, 1240, 1265, 1290, 1315, 1340, 1365, 1390, 1415, 1440, 1465, 1490,
       1515, 1540]
# 内表面积
A_L = [0.1211, 0.1603, 0.2049, 0.2548, 0.3103, 0.3711, 0.4374, 0.5090, 0.5861, 0.6686, 0.7566, 0.8499, 0.9487, 1.0529,
       1.1625, 1.3980, 1.6552, 1.9340, 2.2346, 2.5568, 2.9007, 3.2662, 3.6535, 4.0624, 4.4930, 5.0443, 5.5229, 6.0233,
       6.5453, 7.0891, 7.6545, 8.2415, 8.8503, 9.4807, 10.1329, 10.8067, 11.5021, 12.2193, 12.9581, 13.7186, 14.5008,
       15.3047, 16.1303, 16.9775, 17.8464, 18.7370, 19.6493, 20.5832, 21.5389, 22.5162, 23.5152, 24.5359, 25.5782,
       26.6422, 27.7280, 28.8353, 29.9644, 31.1152, 32.2876, 33.4817, 34.6750, 35.9350, 37.1941, 38.4750, 39.7750]
# 容积
V_L = [0.0053, 0.0080, 0.0115, 0.0159, 0.0213, 0.0277, 0.0353, 0.0420, 0.0545, 0.0630, 0.0796, 0.0246, 0.1113, 0.1300,
       0.1505, 0.1980, 0.2545, 0.3208, 0.3970, 0.4860, 0.5864, 0.6999, 0.8270, 0.9687, 1.1257, 1.3508, 1.5459, 1.7588,
       1.9905, 2.2417, 2.5131, 2.8055, 3.1198, 3.4567, 3.8170, 4.2015, 4.6110, 5.0463, 5.5080, 5.9972, 6.5144, 7.0605,
       7.6364, 8.2427, 8.8802, 9.5498, 10.2523, 10.9883, 11.7588, 12.5644, 13.4060, 14.2844, 15.2003, 16.1545, 17.1479,
       18.1811, 19.2550, 20.3704, 21.5281, 22.7288, 23.9733, 25.2624, 26.5969, 27.9776, 29.4053]

# 输入待测封头公称直径gczj
gczj = int(input('请输入待测公称直径：'))

D = DN_L.index(int(gczj))

# 搜索封头总适深度
H = int(H_L[D])

# 搜索封头内表面积
A = float(A_L[D])

# 搜索封头容积
V_R = float(V_L[D])
San_1 = '1、确定承压设备公称直径:依据GB/T9019-2001\n初选本设计的承压设备公称直径为{0}mm\n'.format(gczj)

San_21 = '（1）查公称直径为1100mm标准椭圆形封头容积\n得:V封头=0.1980，总深度H=300mm\n'.format(gczj, D, H, V)

# 输入设计总体积
V_Z = V
# 计算筒体的容积V筒体
V_TT = V_Z - 2 * V_R

San_23 = '(3）计算筒体的容积V筒体\nV筒体=V总-2V封头={0}-2*{1}={2}m^3\n'.format(V_Z, V_R, V_TT)

# 计算筒体长度L筒体
d = float(gczj / 1000)
L_TT = ((4 * V_TT) / 3.14 / (d ** 2))
San_22 = '（2）计算筒体长度L筒体\n根据公式V筒体=πD2/4L筒体可得\nL筒体=4V筒体/π/D2=4*{0}/π/{1}={2}mm\n'.format(V_TT, d, L_TT)

# 计算总长度L
h = H / 1000
L_Z = 2 * h + L_TT

# 计算长径比B
B = float(L_Z / d)

San_24 = '（4）计算长径比B\n总长度L=2H+L筒体=2*{0}+{1}={2}m\nB=L/D={2}/{3}≈{4}（近似值）\n'.format(h, L_TT, L_Z, d, B)
if 2 < B < 3:
    San_jl = '结论：以上公称直径选取{0}mm是合格的\n'.format(gczj)
else:
    San_jl = '结论：以上公称直径选取{0}mm是不合格的\n'.format(gczj)
San_2 = San_21 + San_22 + San_23 + San_24
San = '第三章几何参数设计\n目标:解决筒体长度和公称直径的问题 DN\n判定原理：长径比为2-3\n'

# 第四章强度设计

Pc = Pd  # 计算压力
Pcx = format(Pc, '.3f')
Di = gczj  # 公称直径
C1 = 0.3  # float(input('钢板厚度负偏差C1（在二、9）：'))
C2 = 2  # float(input('请输入腐蚀余量C2（在二、9）：'))

xu_ying_li = 189  # 压力
han_jie_tou_xi_su = 1
# 筒体计算厚度 TT_hd
TT_hd = (Pc * Di) / (2 * xu_ying_li * han_jie_tou_xi_su - Pc)
TT_hd1 = "%.3f" % TT_hd
Si_11 = '1）先假设筒体厚度为6-16mm,查“常用钢板的许用应力”表得设计温度为60℃时的许用应力[σ]t=189MPa，将以上参数代入公式得筒体计算厚度为\nδ_c=(p_c D_i)/(2[σ]_tφ-p_c )=({0}*{1})/2*{2}*{3}-{0}≈{4}\n'.format(
    Pcx, Di, xu_ying_li, han_jie_tou_xi_su, TT_hd1)
# 求设计壁厚δ_d sjbh
sjbh = TT_hd + C2
sjbh1 = "%.3f" % sjbh
Si_12 = '2)求设计壁厚δ_d\nδ_d=δ_c+C_2={0}+{1}={2}mm\n'.format(TT_hd1, C2, sjbh1)
# 求名义厚度δ_n
mhd1 = sjbh + C1
mhd2 = "%.3f" % (sjbh + C1)
mhd = sjbh + C1
while mhd % 2 != 0:
    mhd = int(mhd)
    mhd += 1
else:
    tygj = mhd
    mhd1 = "%.3f" % mhd
Si_13 = '3)求名义厚度δ_n\n确定名义壁厚需要考虑二个因素，一个是钢板的厚度负偏差，另外一个是钢板的标准厚度系列，C1={0}mm，{1}+{0}={4}mm（向上圆整到钢板的标准厚度系列）,故δ_n={3}mm（向上取偶数）\n'.format(
    C1, sjbh1, mhd, tygj, mhd2)
Si_14 = '4）检查\nδ_n在假设筒体厚度范围为6-16mm范围，故最后得筒体的名义壁厚为{0}mm\n'.format(mhd)
Si_1 = '1、筒体计算壁厚δ_c\n' + Si_11 + Si_13 + Si_14
p_c = Pd
D_i = gczj
a_t = 189
fai = 1
# 封头计算厚度
FTH = (p_c * D_i) / (2 * a_t - p_c)
FTHx = format(FTH, '.3f')
Si_21 = '1）先假设封头厚度为6-16mm，查“常用钢板的许用应力” (Q245R)表得设计温度为30°C时的许用应力[σ]t=189MPa，将以上参数代入公式得封头计算厚度为\n(p_c D_i)/2[σ]_tφ-p_c={0}\n'.format(
    FTHx)
# 求设计壁厚δd fai_d
fai_d = TT_hd + C2
fai_dx = format(fai_d, '.3f')
Si_22 = '2）求设计壁厚δd\nδd=δc+C2={0}+{1}={2}mm\n'.format(TT_hd1, C2, fai_dx)
# 求名义壁厚δn fai_n
fai_n = C1 + fai_d
fai_nx = format(fai_n, '3f')
fai_n_int = int(fai_n)
if fai_n_int % 2 == 0:
    fai_n_int += 2
else:
    fai_n_int += 1

Si_23 = '3）求名义壁厚δn\n确定名义壁厚需要考虑二个因素，一个是钢板的厚度负偏差，另外一个是钢板的标准厚度系列，C1={0}mm，{1}+{0}={2} mm（向上圆整到钢板的标准厚度系列）\n故δn={3}mm\n'.format(
    C1, fai_dx, fai_nx, fai_n_int)
if 6 <= fai_n_int <= 16:
    Si_24 = 'δn={}mm在假设封头厚度为6-16mm范围，有效\n'.format(fai_n_int)
else:
    Si_24 = 'δn={}mm不在假设封头厚度为6-16mm范围，无效\n'.format(fai_n_int)
Si_2 = '2、标准椭圆形封头计算壁厚δc\n' + Si_21 + Si_22 + Si_23 + Si_24
Si = '第四章 强度设计（强度计算公式人工计算）\n目标：计算筒体和封头的壁厚，最终确定筒体和封头的名义壁厚\n' + Si_1 + Si_2

All = Yi + Er + San + Si
print(All)
Programe_colse()
# Q345R和Q245R
